cleanli2/stm32f407ve/Core/Src/cmd.c
              if((bytesread == 0) || (res != FR_OK))
              {
                logline;
                break;
              }
              else
              {
#if 0
                //mem_print((char*)read_buf, 0, sizeof(read_buf));
                for(int ti=0;ti<bytesread;ti+=2){
                    Lcd_WriteData_16Bit((read_buf[ti]<<8)|read_buf[ti+1]);
                }
#else
                rgb565_to_lcd(read_buf, bytesread);
#endif
              }
            }
            pic_ms=HAL_GetTick()-pic_ms;
            prt_dec(pic_ms);
            /*##-9- Close the open text file #############################*/
            f_close(&MyFile);
        }
        else{
            logline;
        }
        p1++;

        }//-------------------------------------------------------------------------

    }
    else if(para==9){
        lprintf("cam init test\r\n");
        uint p1=7;
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        lprintf("cam init %d\r\n", p1);
        cam_init(p1);
    }
    else if(para==0x1cd){
        lprintf("lcd win set\r\n");
        uint p1=640, p2=480;
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        if(np >= 3){
            p=str_to_hex(p, &p2);
        }
        lprintf("lcd %dx%d\r\n", p1, p2);
        g_frame_w=p1;
        g_frame_h=p2;
        LCD_SetWindows(0,0,p1-1,p2-1);
    }
    else if(para==0xa || para ==0xa5){
        HAL_StatusTypeDef ret;
        uint p1=320;
        swap=0;
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        if(np >= 3){
            swap=1;
        }
        lprintf("start cam receive %d\r\n", p1);
        //0x20004000 -> (320x240=76800)0x12c00 ->0x20016c00
        cam_dma_err=0;
        cam_linect=0;
        cam_vsct=0;
        cam_fmct=0;
        ghn=0;
        gfn=0;
        dmabsz=p1;

        HAL_DCMI_Stop(&hdcmi);
        if(para==0xa){
        ret=HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_CONTINUOUS, (uint32_t)0x20004000, p1/4);
        }
        else{
        ret=HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)0x20004000, p1/4);
        }
        hnl=ghn, fnl=gfn;
        prt_hex(ret);
        lprintf("start cam receive done\r\n");
    }
    else if(para==0xb){
        lprintf("check cam receive\r\n");
        prt_hex(HAL_DCMI_GetState(&hdcmi));
        prt_hex(hdcmi.ErrorCode);
        prt_dec(cam_dma_err);
        prt_dec(cam_linect);
        prt_dec(cam_vsct);
        prt_dec(cam_fmct);
        LCD_SetWindows(0,0,639,479);
        rgb565_to_lcd((u8*)0x20004000, 0x1c000);
    }
    else if(para==0xb2){
        //int n=0x1c000/2;
        //uint16_t*tp=(uint16_t*)0x20004000;
        lprintf("check cam receive (2)\r\n");
        prt_hex(HAL_DCMI_GetState(&hdcmi));
        prt_hex(hdcmi.ErrorCode);
        prt_dec(cam_dma_err);
        prt_dec(cam_linect);
        prt_dec(cam_vsct);
        prt_dec(cam_fmct);
        LCD_SetWindows(0,0,639,479);
        int time=HAL_GetTick();
        rgb565_to_lcd_noswap((u8*)0x20004000, 0x1c000);
        prt_dec(HAL_GetTick()-time);
        /*
        while(n--){
			Lcd_WriteData_16Bit(*tp++);
        }
        */
    }
    else if(para==0xb3){//move forwad 1 byte
        int n=0x1c000/2-1;
        uint16_t t;
        uint8_t* t8p=(uint8_t*)0x20004001;
        lprintf("check cam receive (3)\r\n");
        prt_hex(HAL_DCMI_GetState(&hdcmi));
        prt_hex(hdcmi.ErrorCode);
        prt_dec(cam_dma_err);
        prt_dec(cam_linect);
        prt_dec(cam_vsct);
        prt_dec(cam_fmct);
        LCD_SetWindows(0,0,639,479);
        while(n--){
            t=(*t8p++)<<8;
            t+=*t8p++;
			Lcd_WriteData_16Bit(t);
        }
    }
    else if(para==0x171){
        lprintf("toggle 71 1\r\n");
        g_cam_r71p_e=1-g_cam_r71p_e;
        prt_dec(g_cam_r71p_e);
    }
    else if(para==0x170){
        lprintf("toggle 70 1\r\n");
        g_cam_r70p_e=1-g_cam_r70p_e;
        prt_dec(g_cam_r70p_e);
    }
    else if(para==0xdccf){
        uint p1=0x101;
        lprintf("dcmi config\r\n");
        if(np >= 2){
            p=str_to_hex(p, &p1);
        }
        g_dcmi_cfg=p1;
        prt_hex(g_dcmi_cfg);
        MX_DCMI_Init();
    }
}
void cam_reg(char *p)
{
    uint addr, value, tmp,ret;

    tmp = get_howmany_para(p);
    if(tmp == 0 || tmp > 2)
	goto error;
    p = str_to_hex(p, &addr);
    if(tmp == 1){
        value=cam_r_reg(addr);
        lprint("Read 0x%x@0x%x ret=%x\r\n",value,addr,camreaderr);
    }
    else{
        p = str_to_hex(p, &value);
        ret=cam_w_reg(addr, value);
        lprint("Write 0x%x@0x%x ret=%x\r\n",value,addr,ret);
    }
    prt_dec(fps);
    return;

error:
    lprint("Err!\r\ncr addr [data]\r\n");
}

void event_handle()
{
    uint timetk_l;
    if(ghn>hnl){
        hnl=ghn;
        if(swap) rgb565_to_lcd((uint8_t*)0x20004000, dmabsz/2);
        else rgb565_to_lcd_noswap((uint8_t*)0x20004000, dmabsz/2);
    }
    if(gfn>fnl){
        fnl=gfn;
        timetk_l=HAL_GetTick();
        if(swap) rgb565_to_lcd((uint8_t*)0x20004000+dmabsz/2, dmabsz/2);
        else rgb565_to_lcd_noswap((uint8_t*)0x20004000+dmabsz/2, dmabsz/2);
        fps = 1000*dmabsz/(timetk_l-g_timetk)/g_frame_w/g_frame_h/2;
        g_timetk=timetk_l;
    }
}
void buf_swap(uint32_t*buf1, uint32_t*buf2, uint32_t sizeofu32)
{
    uint32_t t;
    register uint32_t index=0;
    for(index=0;index<sizeofu32;index++){
        t=buf1[index];
        buf1[index]=buf2[index];
        buf2[index]=t;
    }
}
#define START_SECTORS_PIC (0x100000/512)
#define SECTORS_PER_PIC (320*240*2/512)
#define CAM2SD_DMA_ADDR 0x20004000
#define CAM2SD_DMA_SIZE 0x19000
#define CAM2SD_BACK_BUF 0x10000000
#define HALF_CAM2SD_DMA_SIZE (CAM2SD_DMA_SIZE /2)
#define MAX_PICS 200000
#define MAX_SECS (START_SECTORS_PIC+MAX_PICS*SECTORS_PER_PIC)
void cam2sd(char*p)
{
    uint np, npic=1, fi=0, timeout=0, fail=0, l_ts=0, ts;
    HAL_StatusTypeDef ret;

    if(g_lcd)LCD_SetWindows(0,0,319,239);   
    dmabsz=CAM2SD_DMA_SIZE;
    lprint("cam2sd [number] [start]\r\n");
    np = get_howmany_para(p);
    if(np >= 1){
        p=str_to_hex(p, &npic);
    }
    if(np >= 2){
        p=str_to_hex(p, &fi);
    }
    prt_dec(npic);
    prt_dec(fi);
    //MX_DCMI_Init();
    //cam_init(0xa);
    ghn=0;
    gfn=0;
    hnl=ghn;
    fnl=gfn;
#ifdef SAVE_CAM_FILESYS
    char fn[16];
    uint byteswrite;
    FIL picfile;
    FRESULT res;
#else
    uint sec_w=START_SECTORS_PIC+SECTORS_PER_PIC*fi++;
#endif
    while(npic--){
        u32 sv_ms=HAL_GetTick();
        HAL_DCMI_Stop(&hdcmi);
        ret=HAL_DCMI_Start_DMA(&hdcmi, DCMI_MODE_SNAPSHOT, (uint32_t)CAM2SD_DMA_ADDR, CAM2SD_DMA_SIZE/4);
        (void)ret;
        //prt_hex(ret);
        timeout=HAL_GetTick();
        //wait half buffer done
        while(ghn==hnl)
        {
            if((HAL_GetTick()-timeout)>100){
                lprintf("---timeout\r\n");
                fail++;
                break;;
            }
        }
        if((HAL_GetTick()-timeout)>100){
            if(fail<10)continue;
            else if(fail<20){
                lprintf("dcmi init\r\n");
                MX_DCMI_Init();
                continue;
            }
            else{
                lprintf("can't recover dcmi\r\n");
                return;
            }
        }
        else{
            fail=0;
        }
        hnl=ghn;
        memcpy((uint8_t*)CAM2SD_BACK_BUF, (uint8_t*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE);
        while(gfn==fnl);
        fnl=gfn;
        while(ghn==hnl);
        hnl=ghn;
        //lprintf("1 frame done now, write to sd\r\n");
        //swap back buf and dma buf
        buf_swap((uint32_t*)CAM2SD_BACK_BUF, (uint32_t*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE/4);
#ifdef SAVE_CAM_FILESYS
        slprintf(fn, "square%d.bin", fi++);
        if(f_open(&picfile, fn, FA_CREATE_ALWAYS|FA_WRITE) == FR_OK){
            lprintf("open %s OK\r\n", fn);
            res = f_write(&picfile, (u8*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE, (UINT*)&byteswrite);
            prt_hex(byteswrite);
            prt_hex(res);
            res = f_write(&picfile, (u8*)(CAM2SD_DMA_ADDR+HALF_CAM2SD_DMA_SIZE), HALF_CAM2SD_DMA_SIZE, (UINT*)&byteswrite);
            prt_hex(byteswrite);
            prt_hex(res);
            buf_swap((uint32_t*)CAM2SD_BACK_BUF, (uint32_t*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE/4);
            res = f_write(&picfile, (u8*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE, (UINT*)&byteswrite);
            prt_hex(byteswrite);
            prt_hex(res);

            f_close(&picfile);
            lprintf("write to sd done\r\n");
        }
        else{
            logline;
        }
#else
        if((fi%10)==0){
            ts=HAL_GetTick();
            lprintf("frame index=%d(0x%x) fps=%d\r\n", fi, fi, 10000/(ts-l_ts));
            l_ts=ts;
        }
        if(sec_w>=MAX_SECS){
#ifdef NO_OVER_WRITE
            while(1){
                prt_dec(sec_w);
                prt_dec(fi);
                HAL_Delay(2000);
            }
#else
            fi=0;
            sec_w=START_SECTORS_PIC;
#endif
        }
        sd_write((u8*)CAM2SD_DMA_ADDR, sec_w, SECTORS_PER_PIC/3);
        if(g_lcd) rgb565_to_lcd_noswap((u8*)CAM2SD_DMA_ADDR, CAM2SD_DMA_SIZE/2);
        sec_w+=SECTORS_PER_PIC/3;
        sd_write((u8*)CAM2SD_DMA_ADDR+HALF_CAM2SD_DMA_SIZE, sec_w, SECTORS_PER_PIC/3);
        if(g_lcd) rgb565_to_lcd_noswap((u8*)CAM2SD_DMA_ADDR+HALF_CAM2SD_DMA_SIZE, CAM2SD_DMA_SIZE/2);
        sec_w+=SECTORS_PER_PIC/3;
        buf_swap((uint32_t*)CAM2SD_BACK_BUF, (uint32_t*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE/4);
        sd_write((u8*)CAM2SD_DMA_ADDR, sec_w, SECTORS_PER_PIC/3);
        if(g_lcd) rgb565_to_lcd_noswap((u8*)CAM2SD_DMA_ADDR, CAM2SD_DMA_SIZE/2);
        sec_w+=SECTORS_PER_PIC/3;
        fi++;
#endif
        sv_ms=HAL_GetTick()-sv_ms;
        prt_dec(sv_ms);
        if(con_is_recved()&&con_recv()=='q')
        {
            lprintf("'q' recved\r\n");
            break;
        }
        if(HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_0) != GPIO_PIN_RESET)
        {
            lprintf("A0 pressed\r\n");
            break;
        }
        REC_LED_TOGGLE();
    }
    return;
}
void sd2lcd(char*p)
{
    uint np, npic=1, fi=0, sec_r, l_ts=0, ts;
    if(!g_lcd){
        lprintf("no lcd\r\n");
        return;
    };
    LCD_SetWindows(0,0,319,239);   

    lprint("sd2lcd [number] [start]\r\n");
    np = get_howmany_para(p);
    if(np >= 1){
        p=str_to_hex(p, &npic);
    }
    if(np >= 2){
        p=str_to_hex(p, &fi);
    }
    prt_dec(npic);
    prt_dec(fi);

    sec_r=START_SECTORS_PIC+SECTORS_PER_PIC*fi;
    while(npic--){
        if((fi%10)==0){
            ts=HAL_GetTick();
            lprintf("frame index=%d(0x%x) fps=%d\r\n", fi, fi, 10000/(ts-l_ts));
            l_ts=ts;
        }
        if(sec_r>=MAX_SECS){
            while(1){
                prt_dec(sec_r);
                prt_dec(fi);
                HAL_Delay(2000);
            }
        }
        sd_read((u8*)CAM2SD_DMA_ADDR, sec_r, SECTORS_PER_PIC*2/3);
        rgb565_to_lcd_noswap((u8*)CAM2SD_DMA_ADDR, CAM2SD_DMA_SIZE);
        sec_r+=SECTORS_PER_PIC*2/3;
        sd_read((u8*)CAM2SD_DMA_ADDR, sec_r, SECTORS_PER_PIC/3);
        rgb565_to_lcd_noswap((u8*)CAM2SD_DMA_ADDR, HALF_CAM2SD_DMA_SIZE);
        sec_r+=SECTORS_PER_PIC/3;
        fi++;
        if(con_is_recved()&&con_recv()=='q')
        {
            lprintf("'q' recved\r\n");
            break;
        }
    }
}
static const struct command cmd_list[]=
{
    {"cam2sd",cam2sd},
    {"cr",cam_reg},
    {"exit",cmd_exit},
    {"help",print_help},
    {"history",history},
    {"hr",read_mem16},
    {"hw",write_mem16},
    {"pm", print_mem},
    {"r",read_mem},
    {"reboot",reboot},
    {"sd2lcd",sd2lcd},
    {"test",test},
    {"w",write_mem},
    {NULL, NULL},
};
static uint32_t * mrw_addr;
void go(char *para)
{
    (void)para;
	(*((void (*)())mrw_addr))();
}

void print_help(char *para)
{
    (void)para;
    uint i = 0;
    //lprintf("Version %s%s\r\n", VERSION, GIT_SHA1);
    lprint("Cmd:\r\n");
    while(1){
            if(cmd_list[i].cmd_name == NULL)
                    break;
	    lprint("--%s\r\n", cmd_list[i].cmd_name);
            i++;
    }
}

uint asc_to_hex(char c)
{
	if(c >= '0' && c <= '9')
		return c - '0';	
	if(c >= 'A' && c <= 'F')
		return c - 'A' + 10;
	if(c >= 'a' && c <= 'f')
		return c - 'a' + 10;
	return 0;
}

